<template>
        <categoryCarousel></categoryCarousel>
        <div class="text-center">
            <!-- {{ $t('hello') }} -->
        </div>
        <div class="row flex-wrap-reverse">
            <div class="col-lg-8">
                <div class="flex-between border-bottom mb-3 pb-3 ">
                    <h6 class="title-border"> مقدمي الخدمة</h6>
                    <div>
                        <!-- <Listbox v-model="selectedCity" :options="cities" filter optionLabel="name"
                            class="w-full md:w-14rem" @click="showList" /> -->
                            
                    </div>
                </div>
                <div class="row">
                    <div class="col-lg-3  col-sm-6 " v-for="provider in serviceProviders" :key="provider.id">
                        <NuxtLink :to="'/providerDetails/' + provider.id" class="rounded-2 main_border overflow-auto mb-3 d-block text-dark">
                            <img :src="provider.img" alt="" class="providerImg">
                            <div class="p-2">
                                <h6 class="mb-2">{{ provider.name }}</h6>
                                <div class="flex-between">
                                    <div>
                                        <font-awesome-icon icon="fa-solid fa-list-check" class="m-end-5" />
                                        <span> {{ provider.id }} # </span>
                                    </div>
                                    <div>
                                        <span class="m-end-5">{{ provider.rateNum }}</span>
                                        <font-awesome-icon icon="fa-solid fa-star" class="text-warning" />
                                    </div>
                                </div>
                            </div>

                        </NuxtLink>
                    </div>
                </div>
            </div>
            <div class="col-lg-4">
                <div class="rounded-2 p-2 main_border mb-3" >
                    <div class="flex-between  border-bottom mb-3 pb-3">
                        <h6 class="title-border"> الطلبات الخاصة</h6>
                    </div>
                    <div v-for="req in Requests" :key="req.id" class="rounded-2 p-2 main_border mb-3">
                        <div class="flex-between">
                            <div>
                                <h6 class="mb-2">{{ req.id }} </h6>
                                <h6>{{ req.city }} </h6>
                            </div>


                            <NuxtLink :to="'/specialOrder/' + req.id" class="text-muted">
                                <font-awesome-icon icon="fa-solid fa-chevron-left" />
                            </NuxtLink>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    <footer-component></footer-component>
</template>
<script>

export default {
    props: ['id'],
    data() {
        return {
            Requests: [
                {
                    id: 'c1',
                    title: 'تمارين',
                    city: 'جدة',
                    orderNumber: '17817178',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة'

                },
                {
                    id: 'c2',
                    mainSection: 'تمارين',
                    city: 'جدة',

                    orderNumber: '17817178',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة'

                },
                {
                    id: 'c2',
                    mainSection: 'تمارين',
                    city: 'جدة',

                    orderNumber: '17817178',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة'
                },
            ],
            serviceProviders: [
                {
                    id: 'p1',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),
                },
                {
                    id: 'p2',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),
                },
                {
                    id: 'p3',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),
                },
                {
                    id: 'p4',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),
                },
                {
                    id: 'p5',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),
                },
                {
                    id: 'p6',
                    name: 'تمارين',
                    rateNum: '3',
                    city: 'جدة',
                    governate: 'محافظة الرين',
                    phoneNumber: '1717177171',
                    descripe: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    img: new URL("../assets/imgs/G2.png", import.meta.url),

                },
            ],
        }
    }
    // methods: {
    //     // document.querySelector('.p-listbox-filter')
    //     showList: function () {

    //         if (document.querySelector(".p-listbox-filter") === document.activeElement) {
    //             document.querySelector(".p-listbox-list-wrapper").classList.add('active')
    //         } else {
    //             document.querySelector(".p-listbox-list-wrapper").classList.remove('active')
    //         }
    //     }

    // }
}
</script>
<style >
.p-listbox {
    border: 0;
    padding: 0;
    position: relative;
}

.p-listbox-header {
    padding: 0 !important
}

.p-listbox-list-wrapper {
    position: absolute;
    top: 54px;
    z-index: 100;
    left: 0;
    right: 0;
    background: white;
    border-top: unset;
    border-radius: 10px;
    display: none;
}

.p-listbox-list-wrapper.active {
    display: block;
}

.p-listbox-filter:focus+.p-listbox-list-wrappe {
    display: block !important
        /* background: red !important; */
}
.p-carousel-indicators{
    display: none !important;
}
</style>